tap "caarlos0/tap"
tap "chef/chef"
tap "eddieantonio/eddieantonio"
tap "getantibody/tap"
tap "github/gh"
tap "go-delve/delve"
tap "golangci/tap"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "adoptopenjdk8"
# Record and share terminal sessions
brew "asciinema"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Command-line benchmark tool
brew "bench"
# The cat cmd with more features
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# an improved `ls` cmd
brew "exa"
# improved top
brew "glances"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Foreman in Go for Procfile-based application management
brew "forego"
# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"
# Simple, fast and user-friendly alternative to 'find'.
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# HTTP client.
brew "httpie"
# GNU awk utility
brew "gawk"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GPG key agent
brew "gpg-agent"
# The Kubernetes package manager
brew "helm"
# The Kubernetes package manager
brew "helm@2"
# Curl statistics made simple
brew "httpstat"
# fast static site generator
brew "hugo"
# imgcat - cat for images!
brew "eddieantonio/eddieantonio/imgcat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# malloc implementation emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Count lines of code quickly
brew "loc"
# YAML Parser
brew "libyaml"
# 'traceroute' and 'ping' in a single tool
brew "mtr", link: false
# MacOS command line tool that lets you interact with utilities and applications entirely in Terminal.
brew "m-cli"
# A command-line system information tool written in bash 3.2+
brew "neofetch"
# 'The text editor that has a cult following. im still learning why'
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Postgres CLI with autocompletion and syntax highlighting."
brew "pgcli"
# Copy/paste anything over the network.
brew "piknik"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Pipe Viewer
brew "pv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Rust language
brew "rustup"
# Display system information in a colorful ascii format and take a screenshot
brew "screenfetch"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Package any app for every Linux desktop, server, cloud or device
brew "snapcraft"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Up deploys infinite number of serverless http servers and APIs
brew "up"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# CSV cli toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# GitHub CLI
brew "github/gh/gh"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
cask "1password"
cask "airflow"
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "docker"
cask "font-hack"
cask "font-jetbrains-mono"
cask "hazel"
cask "goland"
cask "kap"
cask "keepingyouawake"
cask "keybase"
cask "ngrok"
cask "now"
cask "postgres"
# tool that's used for performing queries on streams of records in various formats.
cask "rq"
cask "quicklook-json"
